MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13274/mcu.h
extern volatile RC4PPSbits_t RC4PPSbits __at(0x1DA0);
// bitfield macros
#define _RC4PPS_RC4PPS_POSN                                 0x0
#define _RC4PPS_RC4PPS_POSITION                             0x0
#define _RC4PPS_RC4PPS_SIZE                                 0x6
#define _RC4PPS_RC4PPS_LENGTH                               0x6
#define _RC4PPS_RC4PPS_MASK                                 0x3F

// Register: RC5PPS
#define RC5PPS RC5PPS
extern volatile unsigned char           RC5PPS              __at(0x1DA1);
#ifndef _LIB_BUILD
asm("RC5PPS equ 01DA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC5PPS                 :6;
    };
} RC5PPSbits_t;
extern volatile RC5PPSbits_t RC5PPSbits __at(0x1DA1);
// bitfield macros
#define _RC5PPS_RC5PPS_POSN                                 0x0
#define _RC5PPS_RC5PPS_POSITION                             0x0
#define _RC5PPS_RC5PPS_SIZE                                 0x6
#define _RC5PPS_RC5PPS_LENGTH                               0x6
#define _RC5PPS_RC5PPS_MASK                                 0x3F

// Register: RC6PPS
#define RC6PPS RC6PPS
extern volatile unsigned char           RC6PPS              __at(0x1DA2);
#ifndef _LIB_BUILD
asm("RC6PPS equ 01DA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC6PPS                 :6;
    };
} RC6PPSbits_t;
extern volatile RC6PPSbits_t RC6PPSbits __at(0x1DA2);
// bitfield macros
#define _RC6PPS_RC6PPS_POSN                                 0x0
#define _RC6PPS_RC6PPS_POSITION                             0x0
#define _RC6PPS_RC6PPS_SIZE                                 0x6
#define _RC6PPS_RC6PPS_LENGTH                               0x6
#define _RC6PPS_RC6PPS_MASK                                 0x3F

// Register: RC7PPS
#define RC7PPS RC7PPS
extern volatile unsigned char           RC7PPS              __at(0x1DA3);
#ifndef _LIB_BUILD
asm("RC7PPS equ 01DA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC7PPS                 :6;
    };
} RC7PPSbits_t;
extern volatile RC7PPSbits_t RC7PPSbits __at(0x1DA3);
// bitfield macros
#define _RC7PPS_RC7PPS_POSN                                 0x0
#define _RC7PPS_RC7PPS_POSITION                             0x0
#define _RC7PPS_RC7PPS_SIZE                                 0x6
#define _RC7PPS_RC7PPS_LENGTH                               0x6
#define _RC7PPS_RC7PPS_MASK                                 0x3F

// Register: RD0PPS
#define RD0PPS RD0PPS
extern volatile unsigned char           RD0PPS              __at(0x1DA4);
#ifndef _LIB_BUILD
asm("RD0PPS equ 01DA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0PPS                 :6;
    };
} RD0PPSbits_t;
extern volatile RD0PPSbits_t RD0PPSbits __at(0x1DA4);
// bitfield macros
#define _RD0PPS_RD0PPS_POSN                                 0x0
#define _RD0PPS_RD0PPS_POSITION                             0x0
#define _RD0PPS_RD0PPS_SIZE                                 0x6
#define _RD0PPS_RD0PPS_LENGTH                               0x6
#define _RD0PPS_RD0PPS_MASK                                 0x3F

// Register: RD1PPS
#define RD1PPS RD1PPS
extern volatile unsigned char           RD1PPS              __at(0x1DA5);
#ifndef _LIB_BUILD
asm("RD1PPS equ 01DA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD1PPS                 :6;
    };
} RD1PPSbits_t;
extern volatile RD1PPSbits_t RD1PPSbits __at(0x1DA5);
// bitfield macros
#define _RD1PPS_RD1PPS_POSN                                 0x0
#define _RD1PPS_RD1PPS_POSITION                             0x0
#define _RD1PPS_RD1PPS_SIZE                                 0x6
#define _RD1PPS_RD1PPS_LENGTH                               0x6
#define _RD1PPS_RD1PPS_MASK                                 0x3F

// Register: RD2PPS
#define RD2PPS RD2PPS
extern volatile unsigned char           RD2PPS              __at(0x1DA6);
#ifndef _LIB_BUILD
asm("RD2PPS equ 01DA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD2PPS                 :6;
    };
} RD2PPSbits_t;
extern volatile RD2PPSbits_t RD2PPSbits __at(0x1DA6);
// bitfield macros
#define _RD2PPS_RD2PPS_POSN                                 0x0
#define _RD2PPS_RD2PPS_POSITION                             0x0
#define _RD2PPS_RD2PPS_SIZE                                 0x6
#define _RD2PPS_RD2PPS_LENGTH                               0x6
#define _RD2PPS_RD2PPS_MASK                                 0x3F

// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0x1DA7);
#ifndef _LIB_BUILD
asm("RD3PPS equ 01DA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS                 :6;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0x1DA7);
// bitfield macros
#define _RD3PPS_RD3PPS_POSN                                 0x0
#define _RD3PPS_RD3PPS_POSITION                             0x0
#define _RD3PPS_RD3PPS_SIZE                                 0x6
#define _RD3PPS_RD3PPS_LENGTH                               0x6
#define _RD3PPS_RD3PPS_MASK                                 0x3F

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0x1DA8);
#ifndef _LIB_BUILD
asm("RD4PPS equ 01DA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS                 :6;
    };
} RD4PPSbits_t;
extern volatile RD4PPSbits_t RD4PPSbits __at(0x1DA8);
// bitfield macros
#define _RD4PPS_RD4PPS_POSN                                 0x0
#define _RD4PPS_RD4PPS_POSITION                             0x0
#define _RD4PPS_RD4PPS_SIZE                                 0x6
#define _RD4PPS_RD4PPS_LENGTH                               0x6
#define _RD4PPS_RD4PPS_MASK                                 0x3F

// Register: RD5PPS
#define RD5PPS RD5PPS
extern volatile unsigned char           RD5PPS              __at(0x1DA9);
#ifndef _LIB_BUILD
asm("RD5PPS equ 01DA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD5PPS                 :6;
    };
} RD5PPSbits_t;
